{
  "basics": {
    "name": "Théo TABURET",
    "label": "PhD | Computer Vision & Applied Mathematics",
    "image": "",
    "email": "theo.taburet@protonmail.com",
    "phone": "(33)665313939",
    "url": "https://theotaburet.github.io",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "17000",
      "city": "La Rochelle",
      "countryCode": "France",
      "region": "Charentes-Maritimes"
    },
    "profiles": [
      {
        "network": "Linkedin",
        "username": "theotaburet",
        "url": "https://www.linkedin.com/in/theotaburet"
      }
    ]
  },
  "work": [
    {
      "name": "Université de La Rochelle - Laboratoire L3I / Yooz",
      "position": "Postdoctoral Researcher in Computer Vision and Image Processing",
      "url": "https://www.univ-larochelle.fr/",
      "startDate": "2021-01-01",
      "endDate": "2023-12-31",
      "summary": "Detection of fraud in company documents using deep learning techniques. Focused on detecting double compression through Siamese CNN networks and steganalysis to identify image manipulations and anomalies.",
      "highlights": [
        "Fraud detection using deep learning",
        "Double compression detection with Siamese CNNs",
        "Integration of algorithms with FastAPI"
      ]
    },
    {
      "name": "Université de La Rochelle & Excelia",
      "position": "Teaching Assistant (Lectures & Tutorials)",
      "url": "https://www.univ-larochelle.fr/",
      "startDate": "2022-01-01",
      "endDate": "2023-12-31",
      "summary": "Taught courses in web technologies (L1 & L2) and Computer Vision (M2) at both University of La Rochelle and Excelia.",
      "highlights": ["Web Technologies for L1 & L2 students", "Introduction to Computer Vision for M2 students"]
    },
    {
      "name": "Synerlink S.A.",
      "position": "R&D Mechanical Engineering Apprentice",
      "url": "https://www.synerlink.com/",
      "startDate": "2014-01-01",
      "endDate": "2017-12-31",
      "summary": "Design and dimensioning of thermoforming molds, optimizing the process for production. Involved in R&D project management.",
      "highlights": ["Thermoforming mold design and optimization", "R&D project management"]
    }
  ],
  "volunteer": [
    {
      "organization": "Pignon des Charentes",
      "position": "Co-Organizer & Founder",
      "location": "La Rochelle, France",
      "url": "https://www.instagram.com/pignon_des_charentes/",
      "startDate": "2023-06-01",
      "endDate": "Present",
      "summary": "Pignon des Charentes is an organization that organizes unique bike treasure hunts using riddles, leading participants through the city to a final gathering point where they can relax and socialize. As a co-organizer, I am responsible for creating visual content, designing the riddles, and hosting the event, ensuring a fun and engaging experience for participants.",
      "highlights": [
        "Promoting cycling in urban spaces",
        "Introducing participants to the city from a fresh perspective",
        "Providing a fun after-work activity for companies with a cool vibe",
        "Fostering community connections",
        "Inspiring new cycling enthusiasts"
      ]
    }
  ],
  "education": [
    {
      "institution": "École Centrale de Lille - Laboratoire CRISTAL",
      "location": "Lille, France",
      "url": "https://www.centralelille.fr/",
      "area": "Applied Mathematics (Steganography)",
      "studyType": "PhD",
      "startDate": "2017-01-01",
      "endDate": "2020-12-31",
      "score": "N/A",
      "courses": ["Steganography methods based on sensor noise"]
    },
    {
      "institution": "Cranfield University",
      "location": "Cranfield, UK",
      "url": "https://www.cranfield.ac.uk/",
      "area": "Digital Signal and Image Processing",
      "studyType": "Master of Science",
      "startDate": "2016-01-01",
      "endDate": "2017-12-31",
      "score": "N/A",
      "courses": ["Digital Signal Processing", "Image Analysis"]
    },
    {
      "institution": "École Supérieure des Technologies Industrielles Avancées",
      "location": "Bidart, France",
      "url": "https://www.estia.fr/",
      "area": "General Engineering",
      "studyType": "Engineering Degree",
      "startDate": "2014-01-01",
      "endDate": "2017-12-31",
      "score": "N/A",
      "courses": ["Multidisciplinary engineering (mechanical, electronics, and computer science)"]
    }
  ],
  "certificates": [
    {
      "name": "Python",
      "date": "2021-01-01",
      "issuer": "France Université Numerique",
      "url": "",
      "icon": "fa-brands fa-python"
    },
    {
      "name": "Scikit-learn",
      "date": "2021-01-01",
      "issuer": "France Université Numerique",
      "url": "",
      "icon": "fa-solid fa-chart-line"
    }
  ],
  "publications": [
    {
      "name": "An empirical study of steganography and steganalysis of color images in the JPEG domain",
      "publisher": "Springer International Publishing",
      "releaseDate": "2019-01-01",
      "url": "https://hal.science/hal-01904482/file/iwdw_version.pdf",
      "summary": "This paper provides an empirical analysis of JPEG steganography and steganalysis on color images, identifying optimal strategies for embedding data and analyzing security. Key findings include that embedding strategies should consider statistical dependencies between color channels, with most payloads concentrated in the luminance channel for JPEG quality factors (QF) of 75 and 95. Additionally, concatenated GFR features excel for QF=75 and QF=95, while SCRMQ1 features in the YCbCr domain perform best for QF=100; future work will explore other color sampling mechanisms and deep learning approaches for color JPEG images."
    },
    {
      "name": "A natural steganography embedding scheme dedicated to color sensors in the JPEG domain",
      "publisher": "Society for Imaging Science and Technology",
      "releaseDate": "2019-01-01",
      "url": "https://hal.science/hal-02005407/file/EI-2019.pdf",
      "summary": "This study highlights the complexities and insights gained from implementing Natural Steganography (NS) in the JPEG domain. While NS offers advantages in capacity and security, its practical application requires sophisticated mechanisms, such as handling dependencies between DCT coefficients using computationally intensive methods like 4×64 lattices and covariance matrix decomposition. Key takeaways include the importance of accounting for correlations in color sensor images, the impact of demosaicking algorithms on detectability, and the heightened security of NS for low JPEG quality factors, even with simpler alphabet sizes and varying demosaicking techniques."
    },
    {
      "name": "Stéganographie naturelle pour images JPEG",
      "publisher": "GRESTI'19",
      "releaseDate": "2020-01-01",
      "url": "https://hal.science/hal-02165880/document",
      "summary": "Ce papier résume les progrès récents réalisés en stéganographie naturelle, notamment la faisabilité d’une insertion qui préserve les dépendances entre coefficients DCT dans un cas particulier. Il suggère que des approches similaires pourraient être appliquées à d’autres développements linéaires. Les travaux futurs se concentreront sur ces extensions et sur l’étude de stéganalyses adaptées à des réseaux de neurones."
    },
    {
      "name": "Computing dependencies between DCT coefficients for natural steganography in JPEG domain",
      "publisher": "ACM Workshop on Information Hiding and Multimedia Security",
      "releaseDate": "2019-01-01",
      "url": "https://hal.science/hal-02165866/document",
      "summary": "This paper extends previous work on Natural Steganography in the JPEG domain and color sensors by deriving an explicit form of the covariance matrix of the stego signal in the DCT domain for bilinear demosaicking. The closed-form covariance matrix allows embedding simulations with empirical security comparable to the photo-site domain, but for non-linear demosaicking, Monte Carlo sampling and scaling are more effective. Future research will explore non-Gaussian models for non-linear algorithms and applications of the covariance matrix to improve synchronization in cost-based steganography."
    },
    {
      "name": "Natural steganography in JPEG domain with a linear development pipeline",
      "publisher": "IEEE",
      "releaseDate": "2020-01-01",
      "url": "https://hal.science/hal-02910206/file/TIFS_final.pdf",
      "summary": "This paper advances image processing and steganography by deriving the covariance matrix of stego signal components in the DCT domain, revealing medium-range correlations within and across 8-connected blocks. Using this analytical model, a J-Cov-NS embedding scheme generates stego signals mimicking photonic noise, achieving high security (PE ≥ 40%) and capacity (>2 bpnzAC), but requires significant computational complexity with 4×64 lattices. Future work will address the impact of non-linear developments, simplify lattice usage, and extend the model to color stego images by accounting for inter-channel correlations."
    },
    {
      "name": "JPEG steganography and synchronization of DCT coefficients for a given development pipeline",
      "publisher": "ACM Workshop on Information Hiding and Multimedia Security",
      "releaseDate": "2020-01-01",
      "url": "https://hal.science/hal-02553023/document",
      "summary": "This paper introduces a synchronization mechanism for JPEG steganography that enhances classical additive cost-based embedding schemes by exploiting correlations between DCT coefficients in photonic noise images. The method synchronizes embedding across 8 lattices of disjoint DCT coefficients, accounting for intra-block and inter-block correlations via multivariate Gaussian distributions with a tailored covariance matrix. Results show a 7% improvement in practical security at an embedding rate of 0.28 bpnzAC with JPEG QF95."
    },
    {
      "name": "Jeu de données de tickets de caisse pour la détection de fraude documentaire",
      "publisher": "ATALA",
      "releaseDate": "2023-01-01",
      "url": "https://aclanthology.org/2023.jeptalnrecital-international.16.pdf",
      "summary": "Cet article présente un jeu de données public de 988 tickets conçu pour la détection de documents fraudés, incluant des images, leurs transcriptions, des annotations des zones modifiées, et des détails sur les techniques de falsification. Ce jeu de données est destiné à des tâches de classification et de localisation, offrant une ressource précieuse pour la recherche sur la détection des faux documents. Il ouvre la voie à des approches TALN et multimodales en intégrant non seulement des aspects de vision par ordinateur, mais aussi l’analyse de la cohérence et de la plausibilité du contenu, jusque-là limitées par un manque de données réalistes."
    },
    {
      "name": "Document Forgery Detection in the Context of Double JPEG Compression",
      "publisher": "Springer Nature Switzerland Cham",
      "releaseDate": "2022-01-01",
      "url": "https://link.springer.com/chapter/10.1007/978-3-030-79093-7_7",
      "summary": "The study addresses document forgery detection in the context of double JPEG compression, exploring methods to detect tampered documents using the specific characteristics of image compression."
    },
    {
      "name": "Receipt Dataset for Document Forgery Detection",
      "publisher": "Springer Nature Switzerland Cham",
      "releaseDate": "2023-01-01",
      "url": "https://link.springer.com/chapter/10.1007/978-3-031-21906-2_42",
      "summary": "This work presents a specialized receipt dataset designed for document forgery detection, a key resource for advancing fraud detection techniques in digital forensics."
    },
    {
      "name": "Méthodes de stéganographie fondées sur la prise en compte du bruit de capteur",
      "publisher": "Ecole centrale de Lille",
      "releaseDate": "2020-01-01",
      "url": "https://www.ec-lille.fr",
      "summary": "This PhD thesis proposes steganographic methods that account for sensor noise in image processing, offering novel solutions to improve the robustness and imperceptibility of steganographic techniques."
    },
    {
      "name": "Python Implementation of Natural Steganography: Notebooks accompanying the paper published in IEEE TIFS",
      "publisher": "IEEE",
      "releaseDate": "2024-01-01",
      "url": "https://ieeexplore.ieee.org/document/9723365",
      "summary": "This publication provides Python code and notebooks that demonstrate the implementation of natural steganography methods, supporting the research published in IEEE Transactions on Information Forensics and Security."
    }
  ],
  "skills": [
    {
      "name": "Machine Learning",
      "level": "Expert",
      "icon": "fa-solid fa-brain",
      "keywords": ["Deep Learning", "Convolutional Neural Networks (CNN)", "Anomaly Detection", "Object Detection", "Segmentation", "Fraud Detection"]
    },
    {
      "name": "Computer Vision",
      "level": "Expert",
      "icon": "fa-solid fa-eye",
      "keywords": ["Image Processing", "Steganography", "Image Manipulation Detection", "Object Tracking", "Image Segmentation"]
    },
    {
      "name": "Programming Languages",
      "level": "Advanced",
      "icon": "fa-solid fa-code",
      "keywords": ["Python", "C/C++", "HTML/CSS/JS", "SQL", "MATLAB", "Bash"]
    },
    {
      "name": "Frameworks and Libraries",
      "level": "Advanced",
      "icon": "fa-solid fa-cogs",
      "keywords": ["PyTorch", "TensorFlow", "Keras", "OpenCV", "FastAPI", "scikit-learn"]
    },
    {
      "name": "Development Tools",
      "level": "Advanced",
      "icon": "fa-solid fa-tools",
      "keywords": ["Git", "Docker", "CI/CD Pipelines", "GitHub Actions", "GitLab CI/CD"]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Puzzles",
      "icon": "fa-solid fa-tag",
      "keywords": ["Riddles", "Brain Teasers", "Problem Solving"]
    },
    {
      "name": "Cycling",
      "icon": "fa-solid fa-bicycle",
      "keywords": ["Bikepacking", "Road Cycling", "Gravel Cycling", "Cycling Events"]
    },
    {
      "name": "Outdoor Sports",
      "icon": "fa-solid fa-tree",
      "keywords": ["Hiking", "Trail Running", "Adventure Sports"]
    }
  ],
  "projects": [
    {
      "name": "Ravitools",
      "summary": "Ravitools enhances GPX files by adding offline-accessible points of interest such as water sources, restaurants, and campsites, tailored for long-distance cyclists.",
      "highlights": ["Offline POI integration", "Customizable routes"],
      "startDate": "2024-10-01",
      "endDate": "Present",
      "url": "https://github.com/theotaburet/Ravitools"
    }
  ]
}
